{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "49", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "49", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "28", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "28", "inbound_nodes": [[["49", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "29", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "29", "inbound_nodes": [[["28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "52", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "52", "inbound_nodes": [[["29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "32", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "32", "inbound_nodes": [[["52", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "33", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "33", "inbound_nodes": [[["32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "55", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "55", "inbound_nodes": [[["33", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "36", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "36", "inbound_nodes": [[["55", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "37", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "37", "inbound_nodes": [[["36", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "45", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "45", "inbound_nodes": [[["37", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "46", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "46", "inbound_nodes": [[["45", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "47", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "47", "inbound_nodes": [[["46", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_0", "inbound_nodes": [[["47", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "46/kernel", "shape": [576, 10], "dtype": "float32"}, {"name": "46/bias", "shape": [10], "dtype": "float32"}, {"name": "49/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "49/bias", "shape": [16], "dtype": "float32"}, {"name": "52/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "52/bias", "shape": [32], "dtype": "float32"}, {"name": "55/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "55/bias", "shape": [64], "dtype": "float32"}, {"name": "output_0/kernel", "shape": [10, 2], "dtype": "float32"}, {"name": "output_0/bias", "shape": [2], "dtype": "float32"}]}]}